results/gemma-4/gemma-4-26b-a4b-it/nvfp4/09-reasoning.log
<frozen importlib._bootstrap_external>:1297: FutureWarning: The cuda.cudart module is deprecated and will be removed in a future release, please switch to use the cuda.bindings.runtime module instead.
<frozen importlib._bootstrap_external>:1297: FutureWarning: The cuda.nvrtc module is deprecated and will be removed in a future release, please switch to use the cuda.bindings.nvrtc module instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xf715b709b240>, trust_remote_code=False, seed=42, num_prompts=50, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=4096, random_range_ratio='0.9', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=None, model='nvidia/Gemma-4-26B-A4B-NVFP4', input_len=None, output_len=None, tokenizer='nvidia/Gemma-4-26B-A4B-NVFP4', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=0.2, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/tmp', result_filename='09-reasoning.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-ddbf2e5c-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='gemma-4-26b-a4b-nvfp4', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-16 15:00:25 [utils.py:90] Sampling input_len from [102, 1946] and output_len from [409, 7783]
WARNING: /tokenize unavailable, skipping alignment.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 0.2
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 50/50 [11:16<00:00, 13.53s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Request rate configured (RPS):           0.20      
Benchmark duration (s):                  676.39    
Total input tokens:                      55684     
Total generated tokens:                  209303    
Request throughput (req/s):              0.07      
Output token throughput (tok/s):         309.44    
Peak output token throughput (tok/s):    516.00    
Peak concurrent requests:                44.00     
Total token throughput (tok/s):          391.77    
---------------Time to First Token----------------
Mean TTFT (ms):                          345.74    
Median TTFT (ms):                        342.89    
P50 TTFT (ms):                           342.89    
P90 TTFT (ms):                           457.62    
P95 TTFT (ms):                           492.30    
P99 TTFT (ms):                           550.73    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          73.84     
Median TPOT (ms):                        74.86     
P50 TPOT (ms):                           74.86     
P90 TPOT (ms):                           83.14     
P95 TPOT (ms):                           83.67     
P99 TPOT (ms):                           87.58     
---------------Inter-token Latency----------------
Mean ITL (ms):                           73.08     
Median ITL (ms):                         74.59     
P50 ITL (ms):                            74.59     
P90 ITL (ms):                            90.08     
P95 ITL (ms):                            91.23     
P99 ITL (ms):                            93.29     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          306255.35 
Median E2EL (ms):                        309911.58 
P50 E2EL (ms):                           309911.58 
P90 E2EL (ms):                           463540.75 
P95 E2EL (ms):                           508282.32 
P99 E2EL (ms):                           525613.49 
==================================================